# Compound Structure Reset All Layers Priorities Method

Source: https://www.revitapidocs.com/2026/14e3c83d-7a34-c538-f05f-84996a2e674e.htm

---

| Compound Structure Reset All Layers Priorities Method |
| --- |

Resets all the priorities of all layers to the default priorities defined by their functions.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void ResetAllLayersPriorities()
```

```
Public Sub ResetAllLayersPriorities
```

```
public:
void ResetAllLayersPriorities()
```

```
member ResetAllLayersPriorities : unit -> unit
```
See Also

#### Reference

CompoundStructure Class Autodesk.Revit.DB Namespace